---
kind: type
id: T:Autodesk.Revit.DB.Lighting.SphericalLightDistribution
source: html/978d468b-4c4a-d439-3d87-bd79e211887d.htm
---
# Autodesk.Revit.DB.Lighting.SphericalLightDistribution

This class encapsulates a spherical light distribution.

## Syntax (C#)
```csharp
public class SphericalLightDistribution : LightDistribution
```